package com.weiwei.base.common;

public class VsSearchSql {

	public static final String array[] = new String[] { "ABCabc", "DEFdef", "GHIghi", "JKLjkl", "MNOmno", "PQRSpqrs",
			"TUVtuv", "WXYZwxyz" };

	// static final String chineseArray[] = new String[] {
	// "阿啊呵腌吖锕啊呵嗄啊呵啊呵阿啊呵哀挨埃唉哎捱锿呆挨癌皑捱矮哎" + "蔼霭嗳爱碍艾唉哎隘暧嗳瑷嗌嫒砹安谙鞍氨庵桉鹌广厂俺铵揞埯案按" + "暗岸黯胺犴肮昂盎熬凹熬敖嚣嗷鏖鳌翱獒聱螯廒遨蹈袄拗媪奥澳傲懊"
	// + "坳拗骜岙鏊Aa" + "八吧巴叭芭扒疤笆粑岜捌八拔跋茇菝魃把靶钯把爸罢霸坝耙灞鲅吧罢" + "掰白百摆伯柏佰捭败拜呗稗般班搬斑颁扳瘢癍版板阪坂钣舨办半伴扮"
	// + "瓣拌绊帮邦浜梆膀榜绑棒膀傍磅谤镑蚌蒡包胞炮剥褒苞孢煲龅薄雹保" + "宝饱堡葆褓鸨报暴抱爆鲍曝刨瀑豹趵背悲杯碑卑陂埤萆鹎北被备背辈"
	// + "倍贝蓓惫悖狈焙邶钡孛碚褙鐾鞴臂呗奔贲锛本苯畚奔笨夯坌崩绷嘣甭" + "绷绷蹦迸甏泵蚌逼鼻荸比笔彼鄙匕俾妣吡秕舭必毕币秘避闭壁臂弊辟"
	// + "碧拂毙蔽庇璧敝泌陛弼篦婢愎痹铋裨濞髀庳毖滗蓖埤芘嬖荜贲畀萆薜" + "筚箅哔襞跸狴编边鞭砭煸蝙笾鳊贬扁匾碥窆褊便变遍辩辨辫卞苄汴忭"
	// + "弁缏边标彪勺镖膘骠镳杓飚飑飙瘭髟表裱婊鳔憋瘪鳖别蹩瘪别宾滨彬" + "斌缤濒槟傧玢豳镔鬓殡摈膑髌并兵冰槟饼屏丙柄秉炳禀邴并病摒般波"
	// + "播拨剥玻饽菠钵趵百博伯勃薄泊柏驳魄脖搏膊舶礴帛铂箔渤钹孛亳鹁" + "踣簸跛薄柏簸掰擘檗卜啵逋晡钸不醭补捕堡卜哺卟不部布步怖簿埔埠" + "瓿钚Bb"
	// + "擦拆嚓礤猜才财材裁采彩踩睬采菜蔡参餐骖残惭蚕惨黪惨灿掺璨孱粲" + "苍仓沧舱伧藏操糙曹槽嘈漕螬艚草策测侧厕册恻参岑涔噌层蹭差插叉"
	// + "碴喳嚓杈馇锸查察茶叉茬碴楂猹搽槎檫叉衩镲差刹叉诧岔衩杈汊姹差" + "拆钗柴豺侪虿瘥搀掺觇单缠禅蝉馋潺蟾婵谗廛孱镡澶躔产铲阐谄冁蒇"
	// + "骣颤忏羼昌娼猖伥阊菖鲳长场常尝肠偿倘裳嫦徜苌场厂敞氅昶惝唱畅" + "倡怅鬯超抄吵钞绰剿焯怊朝潮嘲巢晁炒吵耖车砗尺扯彻撤澈掣坼郴琛"
	// + "嗔抻陈沉晨尘臣辰橙忱谌宸碜称趁衬秤谶榇龀伧称撑秤瞠噌铛柽蛏成" + "城程承诚盛乘呈惩澄橙丞埕枨塍铖裎酲逞骋裎称秤吃痴哧嗤蚩笞鸱媸"
	// + "螭眵魑持迟池驰匙弛踟墀茌篪坻尺齿耻侈褫豉赤斥翅啻炽敕叱饬傺彳" + "瘛冲充涌憧忡艟舂茺重崇虫宠冲铳抽瘳愁筹酬绸踌惆畴稠帱俦雠丑瞅"
	// + "臭出初樗除厨躇橱雏锄蜍刍滁蹰处楚储础杵褚楮处触畜矗怵搐绌黜亍" + "憷揣搋揣揣啜踹嘬膪穿川巛氚传船遄椽舡喘舛串钏创窗疮床幢闯创怆"
	// + "吹炊垂锤捶陲椎槌棰春椿蝽纯唇醇淳鹑莼蠢戳踔绰啜辍龊差刺疵呲词" + "辞慈磁瓷兹茨雌祠茈鹚糍此次刺赐伺从匆聪葱囱苁骢璁枞从丛琮淙凑"
	// + "楱辏腠粗徂殂促簇醋卒猝蹴蹙蔟酢蹿撺汆镩攒窜篡爨衰催摧崔隹榱璀" + "脆粹萃翠瘁悴淬毳啐村皴存蹲忖寸搓撮磋蹉嵯矬痤瘥鹾撮脞错措挫厝" + "锉答搭嗒耷褡哒打达答瘩沓鞑怛笪靼妲Cc2", // c
	//
	// "打大塔疸待呆呔逮歹傣大代带待戴袋贷逮殆黛怠玳岱迨骀绐埭甙单担" + "丹耽眈殚箪儋瘅聃郸担胆掸赕疸瘅但担石弹淡旦蛋诞惮啖澹氮萏瘅当" + "裆铛党挡谠当荡档挡宕菪凼砀刀叨忉氘叨导倒岛蹈捣祷到道倒悼盗稻"
	// + "焘帱纛得德锝的地得底得登灯蹬噔簦等戥邓凳瞪澄蹬磴镫嶝提低滴堤" + "嘀氐镝羝的敌迪笛涤嘀狄嫡荻籴觌镝底抵诋邸砥坻柢氐骶的地第帝弟"
	// + "递蒂缔谛睇棣娣碲绨嗲颠滇掂癫巅点典碘踮丶电店甸淀垫殿奠惦佃玷"
	// + "簟坫靛钿癜阽雕刁凋叼貂碉鲷鸟调掉吊钓铫铞爹跌踮叠迭碟谍蝶喋佚"
	// + "牒耋蹀堞瓞揲垤鲽丁盯钉叮町酊疔仃耵玎顶鼎酊定订钉铤腚锭碇啶丢"
	// + "铥东冬咚岽氡鸫懂董硐动洞冻栋恫侗垌峒胨胴硐都兜蔸篼斗抖陡蚪读"
	// + "斗豆逗窦痘都督嘟读独顿毒渎牍犊黩髑椟肚睹堵赌笃度渡肚杜妒镀芏"
	// + "蠹端短断段锻缎煅椴簖堆对队兑敦碓憝怼镦吨敦蹲墩礅镦盹趸顿盾钝"
	// + "炖遁沌囤砘多咄哆掇裰度夺踱铎朵躲垛哚缍舵堕跺剁惰垛驮沲柁Dd"
	// + // d
	// "阿婀屙额俄哦鹅娥峨蛾讹莪锇恶恶饿扼愕遏噩呃厄鄂轭颚鳄谔锷萼腭"
	// + "垩鹗苊阏呃诶诶诶恩蒽摁而儿鸸鲕尔耳迩饵洱珥铒二贰佴Ee"
	// + // e
	// "发罚乏伐阀筏垡法砝发珐翻番帆藩幡蕃凡烦繁泛樊蕃燔矾蘩钒蹯反返" + "饭犯范贩泛梵畈方芳妨坊邡枋钫房防妨坊肪鲂访仿纺彷舫放非飞啡菲"
	// + "扉霏妃绯蜚鲱肥腓淝菲匪诽斐蜚翡悱篚榧费废沸肺吠痱狒镄芾分纷氛" + "芬吩酚玢坟焚汾棼鼢粉分份奋愤粪忿偾瀵鲼风封丰峰疯锋蜂枫烽酆葑"
	// + "沣砜逢缝冯讽唪奉缝凤俸葑佛否缶夫肤敷孵呋稃麸趺跗夫服福佛幅伏" + "符浮扶弗拂袱俘芙孚匐辐涪氟桴蜉苻茯莩菔幞怫艴郛绂绋凫祓砩黻罘"
	// + "稃蚨芾蝠府父腐抚辅甫俯斧脯釜腑拊滏黼服复父负副富付妇附赴腹覆" + "赋傅缚咐阜讣驸赙馥蝮鲋鳆咐Ff3", // f
	//
	// "夹咖嘎胳伽旮嘎噶轧尜钆嘎尕尬该赅垓陔改概盖丐钙芥溉戤干甘肝杆" + "尴乾竿坩苷柑泔矸疳酐感敢赶杆橄秆擀澉干赣淦绀旰刚钢纲缸扛杠冈" + "肛罡港岗钢杠戆筻高糕膏皋羔睾篙槔稿搞藁槁缟镐杲告膏诰郜锆歌格"
	// + "哥戈割胳搁疙咯鸽屹仡圪纥袼革格隔葛阁胳搁蛤嗝骼颌搿膈镉塥鬲个"
	// + "各合盖葛哿舸个各铬硌虼给根跟哏艮亘艮茛更耕庚羹赓耿颈梗哽鲠埂"
	// + "绠更工公共供功攻宫恭躬龚弓肱蚣觥巩拱汞珙共供贡句沟勾钩篝佝枸"
	// + "缑鞲狗苟岣枸笱够购构勾觏垢诟媾遘彀姑骨孤估辜咕呱箍沽菇轱鸪毂"
	// + "菰蛄酤觚骨古股鼓骨谷贾汩蛊毂鹄牯臌诂瞽罟钴嘏蛄鹘故顾固估雇锢"
	// + "梏牿崮痼鲴括瓜刮呱栝胍鸹寡呱剐挂褂卦诖乖掴拐怪关观官冠棺矜莞"
	// + "倌纶鳏管馆莞观惯冠贯罐灌掼盥涫鹳光咣胱桄广犷逛桄规归瑰龟硅闺"
	// + "皈傀圭妫鲑鬼轨诡癸匦庋宄晷簋贵桂跪柜刽炔刿桧炅鳜滚鲧衮绲磙辊"
	// + "棍过锅郭涡聒蝈崞埚呙国帼掴馘虢果裹猓椁蜾过Gg"
	// + // g
	// "哈铪虾蛤哈哈嘿咳嗨还孩骸海胲醢害亥骇氦酣憨顸鼾蚶含寒汗韩涵函" + "晗焓邯邗喊罕阚汉汗憾翰撼旱捍悍瀚焊颔菡撖夯行航吭杭绗珩颃行巷"
	// + "沆蒿薅嚆号毫豪嚎壕貉嗥濠蚝好郝好号浩耗皓昊灏镐颢喝呵诃嗬和何" + "合河核盒禾荷阂涸阖貉曷颌劾菏盍纥蚵翮和何喝赫吓贺荷鹤壑褐黑嘿"
	// + "嗨痕很狠恨哼亨行横衡恒蘅珩桁横哼轰哄烘薨訇红洪鸿宏虹弘泓闳蕻" + "黉荭哄哄讧蕻侯喉猴瘊篌糇骺吼后候後厚侯逅堠鲎乎呼戏忽糊惚唿滹"
	// + "轷烀和胡湖糊核壶狐葫弧蝴囫瑚斛鹄醐猢槲鹕觳煳鹘虎浒唬琥护户互" + "糊虎沪祜扈戽笏岵怙瓠鹱冱华化花哗砉华划滑哗豁猾骅铧话华化划画"
	// + "桦怀徊淮槐踝坏划欢獾还环寰鬟桓圜洹郇缳锾萑缓换患幻唤宦焕痪涣" + "浣奂擐豢漶逭鲩荒慌肓黄皇煌惶徨璜簧凰潢蝗蟥遑隍磺癀湟篁鳇晃"
	// + "恍谎幌晃挥辉灰恢徽堕诙晖麾珲咴虺隳回徊蛔茴洄毁悔虺会汇惠慧溃" + "绘讳贿晦秽诲彗烩荟卉喙恚浍哕缋桧蕙蟪婚昏荤阍混魂浑馄珲混诨溷" + "豁劐攉锪耠和活火伙夥钬和或获货祸惑霍豁藿嚯镬蠖Hh"
	// + // h
	// "Ii4",// i
	//
	// "其几期机基击奇激积鸡迹绩饥缉圾姬矶肌讥叽稽畸跻羁嵇唧畿齑箕屐"
	// + "剞玑赍犄墼芨丌咭笄乩革及即辑级极集急籍吉疾嫉藉脊棘汲岌笈瘠诘"
	// + "亟楫蒺殛佶戢嵴蕺几给己革济纪挤脊戟虮掎麂记系计济寄际技纪继既"
	// + "齐季寂祭忌剂冀妓骥蓟悸伎暨霁稷偈鲫髻觊荠跽哜鲚洎芰家加佳夹嘉"
	// + "茄挟枷珈迦伽浃痂笳葭镓袈跏夹颊戛荚郏恝铗袷蛱假角脚甲搅贾缴绞"
	// + "饺矫佼狡剿侥皎胛铰挢岬徼湫敫钾嘏瘕价假架驾嫁稼家间坚监渐兼艰"
	// + "肩浅尖奸溅煎歼缄笺菅蒹搛湔缣戋犍鹣鲣鞯简减检剪捡拣俭碱茧柬蹇"
	// + "謇硷睑锏枧戬谫囝裥笕翦趼见间件建监渐健剑键荐鉴践舰箭贱溅槛谏"
	// + "僭涧饯毽锏楗腱牮踺将江疆姜浆僵缰茳礓豇讲奖蒋桨耩将强降酱浆虹"
	// + "匠犟绛洚糨教交焦骄郊胶椒娇浇姣跤蕉礁鲛僬鹪蛟艽茭嚼矫峤角脚搅"
	// + "缴绞饺矫佼狡剿侥皎挢徼湫敫铰教觉校叫较轿嚼窖酵噍峤徼醮接结节"
	// + "街阶皆揭楷嗟秸疖喈结节杰捷截洁劫竭睫桔拮孑诘桀碣偈颉讦婕羯鲒"
	// + "解姐界解价介借戒届藉诫芥疥蚧骱家价今金禁津斤筋巾襟矜衿尽仅紧"
	// + "谨锦瑾馑卺廑堇槿进近尽仅禁劲晋浸靳缙烬噤觐荩赆妗经京精惊睛晶"
	// + "荆兢鲸泾旌茎腈菁粳警景井颈憬阱儆刭肼经境竟静敬镜劲竞净径靖痉"
	// + "迳胫弪婧獍靓扃窘炯迥炅究纠揪鸠赳啾阄鬏九酒久韭灸玖就旧救疚舅"
	// + "咎臼鹫僦厩桕柩车据且居俱拘驹鞠锯趄掬疽裾苴椐锔狙琚雎鞫局菊桔"
	// + "橘锔举柜矩咀沮踽龃榉莒枸据句具剧巨聚拒距俱惧沮瞿锯炬趄飓踞遽"
	// + "倨钜犋屦榘窭讵醵苣捐圈娟鹃涓镌蠲卷锩圈卷俊倦眷隽绢狷桊鄄嗟撅"
	// + "噘觉绝决角脚嚼掘诀崛爵抉倔獗厥蹶攫谲矍孓橛噱珏桷劂爝镢蕨觖蹶"
	// + "倔军均君钧筠龟菌皲麇俊峻隽菌郡骏竣捃浚Jj"
	// + // j
	// "咖喀咔卡咯咔佧胩开揩锎慨凯铠楷恺蒈剀垲锴忾看刊堪勘龛戡侃砍坎"
	// + "槛阚莰看嵌瞰阚康慷糠闶扛抗炕亢伉闶钪尻考烤拷栲靠铐犒科颗柯呵"
	// + "棵苛磕坷嗑瞌轲稞疴蝌钶窠颏珂髁咳壳颏可渴坷轲岢可克客刻课恪嗑"
	// + "溘骒缂氪锞蚵肯恳啃垦龈裉坑吭铿空倥崆箜恐孔倥空控抠芤眍口扣寇"
	// + "叩蔻筘哭枯窟骷刳堀苦库裤酷喾绔夸垮侉跨挎胯蒯会快块筷脍哙侩狯"
	// + "浍郐宽髋款框筐匡哐诓狂诳夼况矿框旷眶邝圹纩贶亏窥盔岿悝魁睽逵"
	// + "葵奎馗夔喹隗暌揆蝰捣傀跬愧溃馈匮喟聩篑蒉愦昆坤鲲锟醌琨髡捆悃"
	// + "阃困括适阔扩廓栝蛞Kk"
	// + // k
	// "拉啦喇垃邋拉喇旯砬拉喇落拉辣腊蜡剌瘌蓝啦来莱徕涞崃铼赖睐癞籁" + "赉濑兰蓝栏拦篮澜婪岚斓阑褴镧谰懒览揽榄缆漤罱烂滥啷狼郎廊琅螂"
	// + "榔锒稂阆朗浪郎莨蒗阆捞劳牢唠崂铹痨醪老姥佬潦栳铑落络唠烙酪涝" + "耢肋乐勒仂叻泐鳓了勒擂累雷擂羸镭嫘缧檑累蕾垒磊儡诔耒类泪累擂"
	// + "肋酹嘞棱楞棱塄冷愣哩离丽黎璃漓狸梨篱犁厘罹藜骊蜊黧缡喱鹂嫠蠡" + "鲡蓠里理李礼哩鲤俚逦娌悝澧锂蠡醴鳢力利立历例丽励厉莉笠粒俐栗"
	// + "隶吏沥雳莅戾俪砺痢郦詈荔枥呖唳猁溧砾栎轹傈坜苈疠疬蛎鬲篥粝跞" + "藓璃哩俩联连怜莲廉帘涟镰裢濂臁奁蠊鲢脸敛琏蔹裣练恋炼链殓楝潋"
	// + "量良梁凉粮粱踉莨椋墚两俩魉量亮辆凉谅晾踉靓撩撂聊疗辽僚寥撩撂" + "缭寮燎嘹獠鹩了潦燎蓼钌了料廖镣撩撂尥钌咧裂咧列烈裂劣猎趔冽洌"
	// + "捩埒躐鬣咧林临秘邻琳淋霖麟鳞磷嶙辚粼遴啉瞵凛懔檩廪淋吝躏赁蔺" + "膦拎令灵零龄凌玲铃陵伶聆囹棱菱苓翎棂瓴绫酃泠羚蛉柃鲮领令岭令"
	// + "另呤溜熘留流刘瘤榴浏硫琉遛馏镏旒骝鎏柳绺锍六陆溜碌遛馏镏鹨咯" + "隆龙隆笼胧咙聋珑窿茏栊泷砻癃笼拢垄陇垅弄搂楼喽偻娄髅蝼蒌耧搂"
	// + "篓嵝露陋漏镂瘘喽噜撸卢炉庐芦颅泸轳鲈垆胪鸬舻栌鲁芦卤虏掳橹镥" + "六路陆录露绿鹿碌禄辘麓赂漉戮簏鹭潞璐辂渌蓼逯轳氇旅履屡侣缕吕"
	// + "捋铝偻褛膂稆律绿率虑滤氯驴榈闾峦挛孪栾銮滦鸾娈脔卵乱掠略掠锊" + "抡论轮伦沦仑抡囵纶论落罗捋罗逻萝螺锣箩骡猡椤脶裸倮蠃瘰落络洛" + "骆咯摞烙珞泺漯荦硌雒罗Ll5",// l
	//
	// "呒妈麻摩抹蚂嬷吗麻蟆马吗码玛蚂犸骂蚂唛杩么吗嘛埋霾买荬卖麦迈" + "脉劢颟埋蛮馒瞒蔓谩鳗鞔满螨慢漫曼蔓谩墁幔缦熳镘忙茫盲芒氓邙硭" + "莽蟒漭猫毛猫矛茅髦锚牦旄蝥蟊茆卯铆峁泖昴冒贸帽貌茂耄瑁懋袤瞀"
	// + "么麽没眉梅媒枚煤霉玫糜酶莓嵋湄楣猸镅鹛美每镁浼妹魅昧谜媚寐袂" + "闷门扪钔闷懑焖们蒙蒙盟朦氓萌檬瞢甍礞虻艨蒙猛勐懵蠓蜢锰艋梦孟"
	// + "眯咪迷弥谜靡糜醚麋猕祢縻蘼米眯靡弭敉脒芈密秘觅蜜谧泌汨宓幂嘧" + "糸棉眠绵免缅勉腼冕娩渑湎沔眄黾面喵描苗瞄鹋秒渺藐缈淼杪邈眇妙"
	// + "庙缪乜咩灭蔑篾蠛民珉岷缗玟苠敏悯闽泯皿抿闵愍黾鳘名明鸣盟铭冥" + "茗溟瞑暝螟酩命谬缪摸无模麽磨摸摩魔膜蘑馍摹谟嫫抹没默莫末冒磨"
	// + "寞漠墨抹陌脉嘿沫蓦茉貉秣镆殁瘼耱貊貘哞谋牟眸缪鍪蛑侔某模毪母"
	// + "姆姥亩拇牡目木幕慕牧墓募暮牟穆睦沐坶苜仫钼Mm"
	// + // m
	// "嗯唔嗯唔嗯那南拿镎那哪那呢纳娜呐捺钠肭衲哪呐哪乃奶氖艿奈耐鼐" + "佴萘柰囝囡难南男楠喃腩蝻赧难囊囔囊馕馕攮曩孬努挠呶猱铙硇蛲脑"
	// + "恼瑙垴闹淖哪呢呐讷呢呐哪馁那内嫩恁能嗯唔嗯唔嗯妮呢尼泥倪霓坭" + "猊怩铌鲵你拟旎祢泥尿逆匿腻昵溺睨慝伲蔫拈年粘黏鲇鲶碾捻撵辇念"
	// + "廿酿埝娘酿酿鸟袅嬲茑尿溺脲捏涅聂孽蹑嗫啮镊镍乜陧颞臬蘖您恁宁" + "凝拧咛狞柠苎甯聍拧宁拧泞佞妞牛纽扭钮狃忸拗农浓侬哝脓弄耨奴孥" + "驽努弩胬怒女钕恧衄暖虐疟娜挪傩诺懦糯喏搦锘Nn" + // n
	// "噢喔哦哦区欧殴鸥讴瓯沤偶呕藕耦呕沤怄Oo6", // o
	//
	// "派扒趴啪葩爬扒耙杷钯筢怕帕琶拍排牌徘俳排迫派湃蒎哌番攀潘扳般"
	// + "盘胖磐蹒爿蟠判盼叛畔拚襻袢泮乓膀滂旁庞膀磅彷螃逄耪胖炮抛泡脬"
	// + "跑炮袍刨咆狍匏庖跑炮泡疱呸胚醅陪培赔裴锫配佩沛辔帔旆霈喷盆湓"
	// + "喷烹抨砰澎怦嘭朋鹏彭棚蓬膨篷澎硼堋蟛捧碰批坏披辟劈坯霹噼丕纰"
	// + "砒邳铍皮疲啤脾琵毗郫鼙裨埤陴芘枇罴铍陂蚍蜱貔否匹劈痞癖圮擗吡"
	// + "庀仳疋屁辟僻譬媲淠甓睥片篇偏翩扁犏便蹁缏胼骈谝片骗漂飘剽缥螵"
	// + "朴瓢嫖漂瞟缥殍莩票漂骠嘌撇瞥氕撇丿苤拼拚姘贫频苹嫔颦品榀聘牝"
	// + "乒娉俜平评瓶凭萍屏冯苹坪枰鲆颇坡泊朴泼陂泺攴钋繁婆鄱皤叵钷笸"
	// + "破迫朴魄粕珀剖裒掊掊铺扑仆噗葡蒲仆脯菩匍璞濮莆镤普堡朴谱浦溥"
	// + "埔圃氆镨蹼暴铺堡曝瀑Pp"
	// + // p
	// "期七妻欺缉戚凄漆栖沏蹊嘁萋槭柒欹桤其奇棋齐旗骑歧琪祈脐祺祁崎"
	// + "琦淇岐荠俟耆芪颀圻骐畦亓萁蕲畦蛴蜞綦鳍麒起企启岂乞稽绮杞芑屺"
	// + "綮气妻器汽齐弃泣契迄砌憩汔亟讫葺碛掐伽葜袷卡恰洽髂千签牵迁谦"
	// + "铅骞悭芊愆阡仟岍扦佥搴褰钎前钱潜乾虔钳掮黔荨钤犍箝鬈浅遣谴缱"
	// + "肷欠歉纤嵌倩堑茜芡慊椠将枪抢腔呛锵跄羌戕戗镪蜣锖强墙蔷樯嫱强"
	// + "抢襁镪羟呛跄炝戗悄敲雀锹跷橇缲硗劁桥乔侨瞧翘蕉憔樵峤谯荞鞒悄"
	// + "巧雀愀翘俏窍壳峭撬鞘诮谯切茄伽且切窃怯趄妾砌惬锲挈郄箧慊亲钦"
	// + "侵衾琴秦勤芹擒矜禽噙廑溱檎锓嗪芩螓寝沁揿吣青清轻倾卿氢蜻圊鲭"
	// + "情晴擎氰檠黥请顷謦苘亲庆罄磬箐綮穷琼穹茕邛蛩筇跫銎秋邱丘龟蚯"
	// + "鳅楸湫求球仇囚酋裘虬俅遒赇泅逑犰蝤巯鼽糗区曲屈趋驱躯觑岖蛐祛"
	// + "蛆麴诎黢渠瞿衢癯劬璩氍朐磲鸲蕖蠼蘧取曲娶龋苣去趣觑阒戌圈悛全"
	// + "权泉拳诠颧蜷荃铨痊醛辁筌鬈犬绻畎劝券缺阙炔瘸却确雀榷鹊阕阙悫"
	// + "逡群裙麇Qq"
	// + // q
	// "然燃髯蚺染冉苒嚷瓤禳穰嚷攘壤禳让饶娆桡荛扰绕娆绕若惹喏热人任"
	// + "仁壬忍稔荏任认韧刃纫饪仞葚妊轫衽扔仍日容荣融蓉溶绒熔榕戎嵘茸"
	// + "狨肜蝾冗柔揉蹂糅鞣肉如儒茹嚅濡孺蠕薷铷襦颥辱乳汝入褥缛洳溽蓐"
	// + "软阮朊蕤蕊瑞锐芮睿枘蚋润闰若弱偌箬Rr"
	// + // r
	// "撒仨挲洒撒萨卅飒脎思塞腮鳃噻赛塞三叁毵散伞馓糁霰散丧桑嗓搡磉" + "颡丧骚搔臊缲缫鳋扫嫂扫梢臊埽瘙色塞涩瑟啬铯穑森僧杀沙刹纱杉莎"
	// + "煞砂挲鲨痧裟铩傻沙啥厦煞霎嗄歃唼筛酾色晒山衫删煽扇珊杉栅跚姗" + "潸膻芟埏钐舢苫髟闪陕掺掸单善扇禅擅膳讪汕赡缮嬗掸骟剡苫鄯钐疝"
	// + "蟮鳝商伤汤殇觞熵墒上赏晌垧上尚绱裳烧稍梢捎鞘蛸筲艄勺韶苕杓芍" + "少绍召稍哨邵捎潲劭奢赊猞畲折舌蛇佘舍社设舍涉射摄赦慑麝滠歙厍"
	// + "谁身深参申伸绅呻莘娠诜砷糁什神甚审沈婶谂哂渖矧甚慎渗肾蜃葚胂" + "椹生声胜升牲甥笙绳渑省眚胜圣盛乘剩嵊晟师诗失施尸湿狮嘘虱蓍酾"
	// + "鲺时十实什识食石拾蚀埘莳炻鲥使始史驶屎矢豕是事世市士式视似示" + "室势试释适氏饰逝誓嗜侍峙仕恃柿轼拭噬弑谥莳贳铈螫舐筮殖匙收熟"
	// + "手首守艏受授售瘦寿兽狩绶书输殊舒叔疏抒淑梳枢蔬倏菽摅姝纾毹殳" + "疋熟孰赎塾秫数属署鼠薯暑蜀黍曙数术树述束竖恕墅漱俞戍庶澍沭丨"
	// + "腧刷唰耍刷衰摔甩率帅蟀栓拴闩涮双霜孀泷爽谁水说税睡吮顺舜瞬说" + "数朔硕烁铄妁蒴槊搠思斯司私丝撕厮嘶鸶咝澌缌锶厶蛳死四似食寺肆"
	// + "伺饲嗣巳祀驷泗俟汜兕姒耜笥厕松忪淞崧嵩凇菘耸悚怂竦送宋诵颂讼" + "搜艘馊嗖溲飕锼螋擞叟薮嗾瞍嗽擞苏稣酥俗诉速素肃宿缩塑溯粟簌夙"
	// + "嗉谡僳愫涑蔌觫酸狻算蒜虽尿荽睢眭濉随遂隋绥髓岁碎遂祟隧邃穗燧" + "谇孙荪狲飧损笋榫隼缩莎梭嗦唆挲娑睃桫嗍蓑羧所索锁琐唢Ss7",// s
	//
	// "他她它踏塌遢溻铊趿塔鳎獭踏拓榻嗒蹋沓挞闼漯台胎苔台抬苔邰薹骀" + "炱跆鲐呔太态泰汰酞肽钛摊贪滩瘫坍谈弹坛谭潭覃痰澹檀昙锬镡郯坦" + "毯忐袒钽探叹炭碳汤趟铴镗耥羰堂唐糖膛塘棠搪溏螳瑭樘镗螗饧醣躺"
	// + "倘淌傥帑趟烫涛掏滔叨焘韬饕绦逃陶桃淘萄啕洮鼗讨套特忑忒慝铽忒" + "腾疼藤誊滕体踢梯剔锑提题啼蹄醍绨缇鹈荑体替涕剃惕屉嚏悌倜逖绨"
	// + "裼天添田填甜恬佃阗畋钿腆舔忝殄掭挑佻祧条调迢鲦苕髫龆蜩笤挑窕" + "跳眺粜贴帖萜铁帖帖餮听厅汀烃停庭亭婷廷霆蜓葶莛挺艇町铤梃梃通"
	// + "恫嗵同童彤铜桐瞳佟酮侗仝垌茼峒潼砼统筒桶捅侗同通痛恸偷头投骰" + "钭透突秃凸图途徒屠涂荼菟酴土吐钍吐兔堍菟湍团抟疃彖推忒颓腿退"
	// + "褪蜕煺吞暾屯饨臀囤豚氽褪托脱拖乇陀舵驼砣驮沱跎坨鸵橐佗铊酡柁" + "鼍妥椭庹魄拓唾柝箨Tt" + // t
	// "Uu" + "Vv8",
	//
	// "挖哇凹娲蛙洼娃瓦佤瓦袜腽哇歪崴外湾弯蜿剜豌完玩顽丸纨芄烷晚碗"
	// + "挽婉惋宛莞娩畹皖绾琬脘菀万腕蔓汪尢王忘亡芒往网枉惘罔辋魍望王"
	// + "往忘旺妄委威微危巍萎偎薇逶煨崴葳隈为维围唯违韦惟帷帏圩囗潍桅"
	// + "嵬闱沩涠委伟唯尾玮伪炜纬萎娓苇猥痿韪洧隗诿艉鲔为位未味卫谓遗"
	// + "慰魏蔚畏胃喂尉渭猬軎温瘟文闻纹蚊雯璺阌稳吻紊刎问纹汶璺翁嗡蓊"
	// + "瓮蕹窝涡蜗喔倭挝莴哦我握卧哦渥沃斡幄肟硪龌於恶屋污乌巫呜诬兀"
	// + "钨邬圬无亡吴吾捂毋梧唔芜浯蜈鼯五武午舞伍侮捂妩忤鹉牾迕庑怃仵"
	// + "物务误恶悟乌雾勿坞戊兀晤鹜痦寤骛芴杌焐阢婺鋈Ww"
	// + // w
	// "西息希吸惜稀悉析夕牺腊昔熙兮溪嘻锡晰樨熄膝栖郗犀曦奚羲唏蹊淅"
	// + "皙汐嬉茜熹烯翕蟋歙浠僖穸蜥螅菥舾矽粞硒醯欷鼷席习袭媳檄隰觋喜"
	// + "洗禧徙玺屣葸蓰铣系细戏隙饩阋禊舄瞎虾呷峡侠狭霞暇辖遐匣黠瑕狎"
	// + "硖瘕柙下夏吓厦唬罅先鲜仙掀纤暹莶锨氙祆籼酰跹闲贤嫌咸弦娴衔涎"
	// + "舷鹇痫显险鲜洗跣猃藓铣燹蚬筅冼现见线限县献宪陷羡馅腺岘苋霰相"
	// + "香乡箱厢湘镶襄骧葙芗缃降详祥翔庠想响享飨饷鲞相向象像项巷橡蟓"
	// + "消销潇肖萧宵削嚣逍硝霄哮枭骁箫枵哓蛸绡魈淆崤小晓筱笑校效肖孝"
	// + "啸些歇楔蝎叶协鞋携斜胁谐邪挟偕撷勰颉缬写血写解谢泄契械屑卸懈"
	// + "泻亵蟹邂榭瀣薤燮躞廨绁渫榍獬心新欣辛薪馨鑫芯昕忻歆锌寻镡信芯"
	// + "衅囟兴星腥惺猩行形型刑邢陉荥饧硎省醒擤性兴姓幸杏悻荇兄胸凶匈"
	// + "汹芎雄熊修休羞咻馐庥鸺貅髹宿朽秀袖宿臭绣锈嗅岫溴需须虚吁嘘墟"
	// + "戌胥砉圩盱顼徐许浒栩诩糈醑续序绪蓄叙畜恤絮旭婿酗煦洫溆勖蓿宣"
	// + "喧轩萱暄谖揎儇煊旋悬玄漩璇痃选癣旋券炫渲绚眩铉泫碹楦镟削靴薛"
	// + "学穴噱踅泶雪鳕血谑熏勋荤醺薰埙曛窨獯寻询巡循旬驯荀峋洵恂郇浔"
	// + "鲟训迅讯逊熏殉巽徇汛蕈浚Xx"
	// + // x
	// "压雅呀押鸦哑鸭丫垭桠牙涯崖芽衙睚伢岈琊蚜雅瞧匹痖疋亚压讶轧娅" + "迓揠氩砑呀烟燕咽殷焉淹阉腌嫣胭湮阏鄢菸崦恹言严研延沿颜炎阎盐"
	// + "岩铅蜒檐妍筵芫闫阽眼演掩衍奄俨偃魇鼹兖郾琰罨厣剡鼽研验沿厌燕" + "宴咽雁焰艳谚彦焱晏唁砚堰赝餍滟酽谳央泱秧鸯殃鞅洋阳杨扬羊疡佯"
	// + "烊徉炀蛘养仰痒氧样漾恙烊怏鞅要约邀腰夭妖吆幺摇遥姚陶尧谣瑶窑" + "肴侥铫珧轺爻徭繇鳐咬杳窈舀崾要药耀钥鹞曜疟耶噎椰掖爷耶邪揶铘"
	// + "也野冶业夜叶页液咽哗曳拽烨掖腋谒邺靥晔一医衣依椅伊漪咿揖噫猗"
	// + "壹铱欹黟移疑遗宜仪蛇姨夷怡颐彝咦贻迤痍胰沂饴圯荑诒眙嶷以已衣"
	// + "尾椅矣乙蚁倚迤蛾旖苡钇舣酏意义议易衣艺译异益亦亿忆谊抑翼役艾"
	// + "溢毅裔逸轶弈翌疫绎佚奕熠诣弋驿懿呓屹薏噫镒缢邑臆刈羿仡峄怿悒"
	// + "肄佾殪挹埸劓镱瘗癔翊蜴嗌翳苫因音烟阴姻殷茵荫喑湮氤堙洇铟银吟"
	// + "寅淫垠鄞霪狺夤圻龈引隐饮瘾殷尹蚓吲印饮荫胤茚窨应英鹰婴樱膺莺"
	// + "罂鹦缨瑛璎撄嘤营迎赢盈蝇莹荧萤萦瀛楹嬴茔滢潆荥蓥影颖颍瘿郢应"
	// + "硬映媵育哟唷哟拥庸佣雍臃邕镛墉慵痈壅鳙饔喁永勇涌踊泳咏俑恿甬"
	// + "蛹用佣优幽忧悠攸呦由游油邮尤犹柚鱿莸尢铀猷疣蚰蝣蝤繇莜有友黝"
	// + "酉莠牖铕卣有又右幼诱佑柚囿鼬宥侑蚴釉於吁迂淤纡瘀于与余予鱼愚"
	// + "舆娱愉馀逾渔渝俞萸瑜隅揄榆虞禺谀腴竽妤臾欤觎盂窬蝓嵛狳舁雩与"
	// + "语雨予宇羽禹圄屿龉伛圉庾瘐窳俣与语育遇狱雨欲预玉愈谷域誉吁蔚"
	// + "寓豫粥郁喻裕浴御驭尉谕毓妪峪芋昱煜熨燠菀蓣饫阈鬻聿钰鹆鹬蜮冤"
	// + "渊鸳眢鸢箢员元原园源圆缘援袁猿垣辕沅媛芫橼圜塬爰螈鼋远院愿怨"
	// + "苑媛掾垸瑗约曰说月乐越阅跃悦岳粤钥刖瀹栎樾龠钺晕氲员云匀筠芸"
	// + "耘纭昀郧允陨殒狁员运均韵晕孕蕴酝愠熨郓韫恽 Yy"
	// + // y
	// "咋灾哉栽甾载仔宰崽在再载簪糌咱攒拶昝趱赞暂瓒錾咱赃臧锗驵藏" + "脏葬奘遭糟凿早澡枣蚤藻缲造灶躁噪皂燥唣则责泽择咋啧迮帻赜笮" + "箦舴侧仄昃贼怎谮曾增憎缯罾赠综缯甑锃查扎咋渣喳揸楂哳吒齄炸"
	// + "扎札喋轧闸铡眨砟炸咋诈乍蜡栅榨柞吒咤痄蚱摘侧斋择宅翟窄债祭" + "寨砦瘵占沾粘瞻詹毡谵旃展斩辗盏崭搌战站占颤绽湛蘸栈张章彰璋"
	// + "蟑樟漳嫜鄣獐长掌涨仉丈涨帐障账胀仗杖瘴嶂幛着招朝嘲昭钊啁着" + "找爪沼照赵召罩兆肇诏棹笊折遮蜇折哲辙辄谪蛰摺磔蜇者褶锗赭这"
	// + "浙蔗鹧柘着这真针珍斟贞侦甄臻箴砧桢溱蓁椹榛胗祯浈诊枕疹缜畛" + "轸稹阵镇震圳振赈朕鸩正争征丁挣症睁徵蒸怔筝铮峥狰钲鲭整拯政"
	// + "正证挣郑症怔铮诤帧之只知指支织氏枝汁掷芝吱肢脂蜘栀卮胝祗直" + "指职值执植殖侄踯摭絷跖埴只指纸止址旨徵趾咫芷枳祉轵黹酯知至"
	// + "制识治志致质智置秩滞帜稚挚掷峙窒炙痔栉桎帙轾贽痣豸陟忮彘膣" + "雉鸷骘蛭踬郅觯中终钟忠衷锺盅忪螽舯种肿踵冢中种重众仲周州洲"
	// + "粥舟诌啁轴妯碡肘帚皱骤轴宙咒昼胄纣绉荮籀繇酎诸朱珠猪株蛛洙" + "诛铢茱邾潴槠橥侏术逐筑竹烛躅竺舳瘃主属煮嘱瞩拄褚渚麈住注助"
	// + "著驻祝筑柱铸伫贮箸炷蛀杼翥苎疰抓挝爪拽转曳拽嘬专砖颛转传转" + "赚撰沌篆啭馔装庄妆桩奘状壮撞幢僮戆追锥隹椎骓坠缀赘惴缒屯谆"
	// + "肫窀准桌捉卓拙涿焯倬着著琢缴灼酌浊濯茁啄斫镯诼禚擢浞资咨滋" + "仔姿吱兹孜谘呲龇锱辎淄髭赀孳粢趑觜訾缁鲻嵫子紫仔梓姊籽滓秭"
	// + "笫耔茈訾自字渍恣眦宗踪综棕鬃枞腙总偬纵粽邹诹陬鄹驺鲰走奏揍" + "租菹足族卒镞组祖阻诅俎钻躜纂缵赚钻攥堆嘴咀觜最罪醉蕞尊遵樽" + "鳟撙作嘬作昨琢笮左佐撮作做坐座凿柞怍胙阼唑祚酢Zz9",// z
	// };
	//
	// /**
	// * 将输入的数字转化问sql查询语句(包括数字对应的拼音)
	// *
	// * @param num
	// * 输入的数字
	// * @return
	// */
	//
	// public static final String SORT_GLOB =
	// " when REPLACE(REPLACE(REPLACE(display_name,'  ',''), ' ', ''), '\"', '') glob ";
	// public static final String OR_SORT_GLOB =
	// " OR REPLACE(REPLACE(REPLACE(display_name,'  ',''), ' ', ''), '\"', '') glob ";
	// public static final String NUMBER_GLOB =
	// "REPLACE(REPLACE(REPLACE(REPLACE(REPLACE(data1, '-', ''), '(', ''), ')', ''), ' ', ''), '.', '')";
	//
	// public static final String UNION_FIRST =
	// "1 > 2)  UNION SELECT _id, display_name, data1, contact_id, times_contacted, data12 ,min(data12) AS data13 ,data14 "
	// + "FROM (SELECT _id, display_name, data1, contact_id, times_contacted,case when %s "
	// + "else 5 end AS data12, length(display_name) AS data14 FROM view_data_restricted data "
	// + "WHERE (1 AND mimetype = 'vnd.android.cursor.item/phone_v2') "
	// + "AND (%s)) "
	// + "GROUP BY (_id) ORDER BY times_contacted desc,data13 asc,display_name COLLATE LOCALIZED asc,data14 asc --(";
	// public static final String UNION_SECOND =
	// "1 > 2)  UNION SELECT _id, display_name, data1, sort_key, contact_id, data10 ,min(data10) AS data9 "
	// + "FROM (SELECT _id, display_name, data1, sort_key, case when sort_key glob %s"
	// + "then 1 when sort_key glob %s then 2 when sort_key glob %s then 3 when sort_key glob %s then 3"
	// + "else 5 end AS data10 FROM view_data_restricted data "
	// + "WHERE (1 AND mimetype = 'vnd.android.cursor.item/phone_v2') "
	// + "AND (sort_key glob %s OR sort_key glob %s OR sort_key glob %s OR sort_key glob %s OR sort_key glob %s)";
	// // public static final String UNION_SECOND
	// //
	// =" UNION SELECT _id, display_name, data1, sort_key, bb.a AS data10 FROM view_data_restricted data LEFT OUTER JOIN (SELECT 2 AS a) AS bb WHERE (1 AND mimetype = 'vnd.android.cursor.item/phone_v2') AND (sort_key glob ";
	// public static final String UNION_THREE =
	// " UNION SELECT _id, display_name, data1, sort_key, bb.a AS data10 FROM view_data_restricted data LEFT OUTER JOIN (SELECT 3 AS a) AS bb WHERE (1 AND mimetype = 'vnd.android.cursor.item/phone_v2') AND (sort_key glob ";
	// public static final String UNION_FORE =
	// " UNION SELECT _id, display_name, data1, sort_key, bb.a AS data10 FROM view_data_restricted data LEFT OUTER JOIN (SELECT 3 AS a) AS bb WHERE (1 AND mimetype = 'vnd.android.cursor.item/phone_v2') AND (sort_key glob ";
	// public static final String UNION_FIVE =
	// " UNION SELECT _id, display_name, data1, sort_key, bb.a AS data10 FROM view_data_restricted data LEFT OUTER JOIN (SELECT 5 AS a) AS bb WHERE (1 AND mimetype = 'vnd.android.cursor.item/phone_v2') AND (data1 glob ";
	// public static final String UNION_END =
	// ") AS tab GROUP BY (_id) ORDER BY data9 asc, sort_key COLLATE LOCALIZED asc --(";

	// public static Spanned transNumToHtml(String num, String type, String name, String phone) {
	// if (type != null && type.matches("^1|2|3|4.*")) {
	// StringBuffer regxString = new StringBuffer();
	// try {
	// for (int i = 0; i < num.length(); i++) {
	// regxString.append("[" + chineseArray[num.charAt(i) - '2'] + "]");
	// }
	// } catch (Exception e) {
	// // TODO: handle exception
	// }
	//
	// String formatString = name.replaceFirst("(" + regxString + ")", "<font color=#5db43b>$1</font>");
	// Spanned htm = Html.fromHtml(formatString);
	// return htm;
	//
	// } else// 电话号码
	// {
	//
	// String formatString = phone.replaceFirst("(" + num + ")", "<font color=#5db43b>$1</font>");
	// Spanned htm = Html.fromHtml(formatString);
	// return htm;
	//
	// }
	//
	// }
	//
	// /**
	// * 将输入数字转化为sql语句 data13 代表权重 data13 = 5表示号码匹配成功， 1,23代表连续匹配成功
	// *
	// * @param num
	// * @return
	// */
	// public static String transNumToSql(String num) {
	// if (num == null || "".equals(num))
	// return null;
	// StringBuffer buffer = new StringBuffer();
	//
	// // if(Integer.parseInt(android.os.Build.VERSION.SDK) > 8)
	// // {
	// // buffer.append(NUMBER_GLOB
	// // +" glob '*"+num+"*'"+") ORDER BY times_contacted desc,display_name COLLATE LOCALIZED asc --(");
	// // return buffer.toString();
	// // }
	// if (num.contains("0") || num.contains("1")) {
	// buffer.append(NUMBER_GLOB + " glob '*" + num + "*'"/* +OR_SORT_GLOB+"'*"+num+"*'" */
	// + ") ORDER BY times_contacted desc,display_name COLLATE LOCALIZED asc --(");
	// return buffer.toString();
	// }
	//
	// int len = num.length();
	// if (len > 5) {
	// buffer.append(NUMBER_GLOB + " glob '*" + num + "*'"/* +OR_SORT_GLOB+"'*"+num+"*'" */
	// + ") ORDER BY times_contacted desc,display_name COLLATE LOCALIZED asc --(");
	// return buffer.toString();
	// }
	//
	// StringBuffer firstBuffer = new StringBuffer();
	// StringBuffer secondBuffer = new StringBuffer();
	//
	// // buffer.append(UNION_FIRST+ "'[" + firstString + "]*");
	//
	// firstBuffer.append("REPLACE(REPLACE(REPLACE(display_name,'  ',''), ' ', ''), '\"', '') glob " + "'["
	// + chineseArray[num.charAt(0) - '2'] + "]");
	// secondBuffer.append("REPLACE(REPLACE(REPLACE(display_name,'  ',''), ' ', ''), '\"', '') glob " + "'*["
	// + chineseArray[num.charAt(0) - '2'] + "]");
	//
	// for (int i = 1; i < len; i++) {
	// firstBuffer.append("[" + chineseArray[num.charAt(i) - '2'] + "]");
	// secondBuffer.append("[" + chineseArray[num.charAt(i) - '2'] + "]");
	// }
	// firstBuffer.append("*' then 1");
	// secondBuffer.append("*'");
	//
	// // if(storeArraysLen <= 1)
	// // {
	// // firstBuffer.append(SORT_GLOB+"'*[" + chineseArray[num.charAt(0) - '2'] + "]*");
	// // secondBuffer.append(OR_SORT_GLOB+"'*[" + chineseArray[num.charAt(0) - '2'] + "]*");
	// // firstBuffer.append("' then 2");
	// // secondBuffer.append("'");
	// // }
	// //
	// // if(storeArraysLen > 1)
	// // {
	// // firstBuffer.append(SORT_GLOB+"'[" + chineseArray[num.charAt(0) - '2'] + "]");
	// // secondBuffer.append(OR_SORT_GLOB+"'[" + chineseArray[num.charAt(0) - '2'] + "]");
	// // for (int i = 1; i < storeArraysLen; i++) {
	// // firstBuffer.append("[" + storeArrays.get(i)
	// // + "]");
	// // secondBuffer.append("[" + storeArrays.get(i)
	// // + "]");
	// // }
	// // firstBuffer.append("*' then 2");
	// // secondBuffer.append("*'");
	// // }
	//
	// firstBuffer.append(SORT_GLOB + "'*[" + chineseArray[num.charAt(0) - '2'] + "]");
	// // secondBuffer.append(OR_SORT_GLOB+"'*[" + chineseArray[num.charAt(0) - '2'] + "]");
	// for (int i = 1; i < len; i++) {
	// firstBuffer.append("[" + chineseArray[num.charAt(i) - '2'] + "]");
	// // secondBuffer.append("[" + chineseArray[num.charAt(i) - '2']
	// // + "]");
	// }
	// firstBuffer.append("*' then 2");
	// // secondBuffer.append("*'");
	// //
	// // if(storeArraysLen > 1)
	// // {
	// // firstBuffer.append(SORT_GLOB+"'[" + firstString + "]");
	// // secondBuffer.append(OR_SORT_GLOB+"'[" + firstString + "]");
	// // for (int i = 1; i < storeArraysLen; i++) {
	// // firstBuffer.append("[" + storeArrays.get(i)
	// // + "]");
	// // secondBuffer.append("[" + storeArrays.get(i)
	// // + "]");
	// // }
	// // firstBuffer.append("*' then 3");
	// // secondBuffer.append("*'");
	// // }
	// //
	// //
	// // if(storeArraysLen > 1)
	// // {
	// // firstBuffer.append(SORT_GLOB+"'* [" + firstString + "]");
	// // secondBuffer.append(OR_SORT_GLOB+"'* [" + firstString + "]");
	// // for (int i = 1; i < storeArraysLen; i++) {
	// // firstBuffer.append("[" + storeArrays.get(i)
	// // + "]");
	// // secondBuffer.append("[" + storeArrays.get(i)
	// // + "]");
	// // }
	// // firstBuffer.append("*' then 3");
	// // secondBuffer.append("*'");
	// // }
	//
	// secondBuffer.append(" OR " + NUMBER_GLOB + " glob '*" + num + "*");
	// secondBuffer.append("'");
	//
	// buffer.append(UNION_FIRST);
	// String retString = String.format(buffer.toString(), firstBuffer.toString(), secondBuffer.toString());
	//
	// return retString;
	//
	// }

}
